'number' + 3 + 3 // 'number33' - відбулось перетворення number (3) у string та конкотенація 

null + 3 // 3 - null перетворюється у 0 і відбувається складання

5 && "qwerty" // "qwerty" - згідно з тим як працює оператор && тут ми виводимо останнє truthy значення

+'40' + +'2' + "hillel" // '42hillel' - тому що + перетворює string у number, вони складаються та відбувається конкотенація 

'10' - 5 === 6 // false - тому що string перетворюється у number, результат віднімання буде number 5 та це не дорівнює number 6

true + false // 1 - бо true та false це булеві значення, тому конкотенація не відбувається і вони переводяться у number і true = 1, а false = 0

'4px' - 3 // NaN - бо string 4px не може перетворитись на number і стає NaN, а NaN - number = NaN

'4' - 3 // 1 - тому що string '4' перетворюється у number 4, а результат віднімання 4 - 3 буде 1

'6' + 3 ** 0 // '61' - тому що 3 у ступені 0 будет 1, а потім відбувається конкотенація 

12 / '6' // 2 - тому що string '6' перетворюється у number 6 і відбувається звичайне ділення

'10' + (5 === 6) // '10false' - тому що (5 === 6) буде булевим значенням false і відбувається конкотенація при котрій false стає string 'false'

null == '' // false - бо в цьому випадку null приводиться до строки 'null' та не дорівнює пустій строці '' 

3 ** (9 / 3) // 27 - тому що 9/3 буде 3 та 3 у 3-му ступені це 27

!!'false' == !!'true' // true - бо будь-яка не перожня строка буде true

!!'false' == !!'true' // true - бо будь-яка не перожня строка буде true

0 || '0' && 1 // 1 - бо 0 це falsy, '0' truthy, 1 truthy та після && ми повертаємо останнє truthy значення

(+null == false) < 1 // false - бо + перетворює null на 0, а він є falsy і дорівнює false, результатом буде true, яке при порівнянні з number 1 теж стає number 1

false && true || true // true - бо && виводить нам false, а true || false це true 

false && (false || true) // false - бо false || true це true, а false && true це false

(+null == false) < 1 ** 5 // false - бо 1 ** 5 це 1, а + перетворює null на 0, і він є falsy та дорівнює false, результатом буде true, яке при порівнянні з number 1 теж стає number 1
